In [1]:
import pandas as pd

In [11]:
df = pd.DataFrame({
    'date': [
        '01.01.2008',
        '12.12.2009',
        '02.11.2010',
        '23.05.2011',
        '15.09.2012'
    ]
})
df

         date
0  01.01.2008
1  12.12.2009
2  02.11.2010
3  23.05.2011
4  15.09.2012

In [5]:
df.dtypes

date    object
dtype: object

In [6]:
pd.to_datetime('12.11.2009', dayfirst=True)

Timestamp('2009-11-12 00:00:00')

In [7]:
pd.to_datetime('12.11.2009', format='%d.%m.%Y')

Timestamp('2009-11-12 00:00:00')

In [8]:
pd.to_datetime('12.11.2009', format='%d.%m.%Y'). month

11

In [9]:
pd.to_datetime('12.11.2009', format='%d.%m.%Y').day

12

In [12]:
df

         date
0  01.01.2008
1  12.12.2009
2  02.11.2010
3  23.05.2011
4  15.09.2012

In [13]:
df.dtypes

date    object
dtype: object

In [22]:
df['dates'] = pd.to_datetime(df.date, format='%d.%m.%Y')
df

         date      dates
0  01.01.2008 2008-01-01
1  12.12.2009 2009-12-12
2  02.11.2010 2010-11-02
3  23.05.2011 2011-05-23
4  15.09.2012 2012-09-15

In [25]:
df.dtypes

date             object
dates    datetime64[ns]
dtype: object

In [26]:
df.dates.dt.day_name()

0     Tuesday
1    Saturday
2     Tuesday
3      Monday
4    Saturday
Name: dates, dtype: object

In [28]:
df.dates.dt.month_name()

0      January
1     December
2     November
3          May
4    September
Name: dates, dtype: object

In [29]:
df[df.dates.dt.day > 10]

         date      dates
1  12.12.2009 2009-12-12
3  23.05.2011 2011-05-23
4  15.09.2012 2012-09-15

In [31]:
df.dates.min()

Timestamp('2008-01-01 00:00:00')

In [32]:
df.dates.max()

Timestamp('2012-09-15 00:00:00')

In [33]:
df.dates.max() - df.dates.min()

Timedelta('1719 days 00:00:00')

In [37]:
df[df.dates > pd.to_datetime('2009-12-12')]

         date      dates
2  02.11.2010 2010-11-02
3  23.05.2011 2011-05-23
4  15.09.2012 2012-09-15

In [38]:
df.dates.nunique()

5

In [41]:
df.set_index('dates', inplace=True)

KeyError: "None of ['dates'] are in the columns"

In [42]:
df

                  date
dates
2008-01-01  01.01.2008
2009-12-12  12.12.2009
2010-11-02  02.11.2010
2011-05-23  23.05.2011
2012-09-15  15.09.2012

In [46]:
df['2009':'2011']

                  date
dates
2009-12-12  12.12.2009
2010-11-02  02.11.2010
2011-05-23  23.05.2011

In [47]:
df['2009-11':'2011-06']

                  date
dates
2009-12-12  12.12.2009
2010-11-02  02.11.2010
2011-05-23  23.05.2011

In [49]:
df['year'] = df.dates.dt.year

AttributeError: 'DataFrame' object has no attribute 'dates'